2019/9. Сентябрь/Три костыля. Сказ про фокусы в коде/src/DataProcessors/ЗаполнитьДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<DataProcessor>
		<Properties>
			<Name>ЗаполнитьДокументы</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

2019/9. Сентябрь/Три костыля. Сказ про фокусы в коде/src/Documents/ТестовыйДокумент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>ТестовыйДокумент</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Рейтинг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

2019/9. Сентябрь/Три костыля. Сказ про фокусы в коде/src/DataProcessors/ЗаполнитьДокументы/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьСервер(КоличествоДокументов, СдвигПоМесяцам);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьСервер(ДокументовДобавить, СдвигПоМесяцам)
	
	Генератор = Новый ГенераторСлучайныхЧисел;
	
	ДокументовДобавить = ДокументовДобавить + 1;
	
	Для Сч = 1 По ДокументовДобавить Цикл
		
		НайденныйДок = Документы.ТестовыйДокумент.НайтиПоНомеру(Формат(Сч, "ЧЦ=11; ЧВН=; ЧГ=0"));
		
		Если НайденныйДок.Пустая() Тогда
			НовДок = Документы.ТестовыйДокумент.СоздатьДокумент();
			НовДок.Дата = ДобавитьМесяц(ТекущаяДата(), СдвигПоМесяцам);
			НовДок.Комментарий = "Это документ №" + (Сч) + " от " + НовДок.Дата;
			НовДок.Рейтинг = Генератор.СлучайноеЧисло(1, 5000);
			НовДок.Сумма = Генератор.СлучайноеЧисло(1, 15000);
			НовДок.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
